# Other bits and pieces of Pandas

Some other useful features within Panda

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Background info


zip() produces an iterable of tuples from one or more arrays

In [20]:
# what does zip() do

languages = ['Java', 'Python', 'JavaScript']
versions = [14, 3, 6]

result = zip(languages, versions)
print(list(result))
print(type(result))

[('Java', 14), ('Python', 3), ('JavaScript', 6)]
<class 'zip'>

In [23]:
# using zip to make multiple iterations make more sense

for languages, versions in zip(languages, versions):
    print(languages)
    print(versions)

Java
14
Python
3
JavaScript
6

In [24]:
# pairing two lists from a list of lists
array_test=[['Java', 'Python', 'JavaScript'],[14, 3, 6]]

print(list(zip(*array_test)))

[('Java', 14), ('Python', 3), ('JavaScript', 6)]

# Multiindexing

This is a hierarchical or multilevel indexing.  It allows you to store data of more than two dimensions in a 2D data frame

It allows for novel groupby, pivoting and reshaping of data

see  

https://pandas.pydata.org/docs/user_guide/advanced.html

In [6]:
# set up two arrays for the indices,  these are nested indices,   with entries one and two for each name

arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

# now zip the arrays into a tuple

tuples = list(zip(*arrays))

print(tuples) 
print("\n\n")

# now form these into a multiindex

index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

print(index)

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]



MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [25]:
# put random values into a multiindexed series

s = pd.Series(np.random.randn(8), index=index)

#notice, the multiindex was use as the index, along rows

# this looks like a  pivot table

s

first  second
bar    one       0.076346
       two       0.506665
baz    one      -0.373134
       two       0.108563
foo    one       1.086595
       two      -0.330963
qux    one       0.731388
       two      -0.720994
dtype: float64

In [44]:
# creating a multi-indexed data frame
# notice this is using the index, so this is multiindexing of rows

df = pd.DataFrame(np.random.randn(8, 4), index=arrays)

df

                0         1         2         3
bar one -1.521963 -1.463046  0.070145  1.556898
    two -0.954557  0.623601 -0.406857  1.159631
baz one -1.192189  0.529724  0.085353 -1.472661
    two -1.079078 -0.802271  0.457234 -0.121581
foo one  0.118811  0.802502  0.918795  1.095111
    two  0.037181 -1.178443  0.462214 -1.093053
qux one -0.685465 -0.360502 -0.188738  1.077028
    two -0.780007 -0.811423  0.384922 -1.019279

In [45]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [46]:
index.get_level_values(1)

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

In [52]:
df.loc['bar'].

            0         1         2         3
one -1.521963 -1.463046  0.070145  1.556898
two -0.954557  0.623601 -0.406857  1.159631

In [53]:
df.loc["bar"].loc["two"]

0   -0.954557
1    0.623601
2   -0.406857
3    1.159631
Name: two, dtype: float64

In [32]:
# we can multiindex columns als well

df2 = pd.DataFrame(np.random.randn(3, 8), index=["A", "B", "C"], columns=index)

df2

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -0.641894 -0.872780 -0.202219  0.052018  2.601914  2.276167 -0.495897
B      -0.470906 -1.087696  0.821964 -0.603633  0.851399  1.458690  0.244693
C       0.219771 -1.772853 -0.707174 -0.159775 -0.297540 -1.147315  0.295882

first
second       two
A      -1.082426
B      -1.248167
C       1.713992

In [54]:
# intersting slices are now possible

df2["bar"]

second       one       two
A      -0.641894 -0.872780
B      -0.470906 -1.087696
C       0.219771 -1.772853

In [55]:
df2["bar","one"]

A   -0.641894
B   -0.470906
C    0.219771
Name: (bar, one), dtype: float64

In [ ]:
# Getting an example data set loaded up

In [2]:
url="https://data.buffalony.gov/resource/fkfv-wqrx.csv"

hydrants=pd.read_csv(url)

In [3]:
hydrants.head()

,the_geom,objectid,hydrant_id,st_number,st_name,cross_st,location,hyd_type,hyd_color,datecollec,x,y,map_num,map_quad,hyd_num,insp_dist,comments
0,POINT (-78.847815301278 42.931013768472),6453,6C-0118,OPP 2254,MAIN ST,FLORENCE AVE,MAIN ST,MUELLER,WHITE,NaN,1077462.97,1068041.44,6,6C,118,5,NaN
1,POINT (-78.887261638708 42.925981934471),6045,5C-0117,312,BIRD AVE,PARKDALE AVE,NWC,K-81,RED,NaN,1066892.43,1066243.28,5,5C,117,2,NaN
2,POINT (-78.834552096816 42.901953752276),1275,12B-0040,288,Loepere St,Walden Ave,NaN,HOWARD,RED,2006-10-06T00:00:00.000Z,1080983.30,1057439.66,12,12B,40,6,NaN
3,POINT (-78.878470724291 42.869767136562),2437,14C-0091,NaN,S MICHIGAN AVE,FUHRMANN BLVD,NaN,K-81,BLUE,NaN,1069175.03,1045747.54,14,14C,91,11,NaN
4,POINT (-78.887564891849 42.93677043205),5871,5B-0025,673,REES ST,NaN,NaN,K-81,YELLOW,NaN,1066825.43,1070175.44,5,5A,146,3,NaN

In [74]:
hydrants.shape

(1000, 17)

In [ ]:
# Dealing with NaN values

In [71]:
# counts of missing data,  pd.isna gives us the binary coding of missing entries

np.sum(pd.isna(hydrants['st_number']))

6

In [72]:
hydrants.loc[pd.isna(hydrants['st_number']),:]

,the_geom,objectid,hydrant_id,st_number,st_name,cross_st,location,hyd_type,hyd_color,datecollec,x,y,map_num,map_quad,hyd_num,insp_dist,comments
3,POINT (-78.878470724291 42.869767136562),2437,14C-0091,NaN,S MICHIGAN AVE,FUHRMANN BLVD,NaN,K-81,BLUE,NaT,1069175.03,1045747.54,14,14C,91,11,NaN
86,POINT (-78.814897504857 42.842680517601),4603,21B-0169,NaN,MCKINLEY PKWY,COOLIDGE RD,HYD SEC MCKINLEY PKWY & COOLIDGE,MATHEWS,RED,NaT,1086189.97,1035822.67,0,21B,0,0,HYD SEC MCKINLEY PKWY & COOLIDGE
204,POINT (-78.878237096688 42.878963730545),2370,14B-0196,NaN,COMMERCIAL ST,PERRY BLVD,84.8' N 1.5' W of NWC PERRY BLVD,MUELLER,BLUE,NaT,1069249.40,1049098.98,14,14B,196,11,NaN
690,POINT (-78.845428565331 42.955192853221),5186,3A-0104,NaN,RACHEL VINCENT WAY,STARIN AVE,2'S 402'W OF W CURB OF STARIN AVE,K-81,RED,NaT,1078129.62,1076851.52,3,3A,104,4,NaN
920,POINT (-78.866870884426 42.88212771143),2371,14B-0197,NaN,DELAMR MITCHELL DRIVE,NaN,282'N 8'E NEC S.DIVISION AND DELMAR MITCHELL,MUELLER,BLUE,NaT,1072299.77,1050241.62,0,14B,0,0,282'N 8'E NEC S.DIVISION AND DELMAR MITCHELL
966,POINT (-78.875213089806 42.954692357742),4814,2A-0098,NaN,Delaware Loop W,NaN,NaN,NaN,RED,NaT,1070155.66,1076695.38,0,NaN,0,0,NaN

In [73]:
np.sum(pd.isna(hydrants['datecollec']))

92

In [91]:
# I want only the date stamped hydrants - notna is the opposite of isna

hydrants_wd=hydrants.loc[pd.notna(hydrants['datecollec']),:]

sum(pd.isna(hydrants_wd['datecollec']))

0

# Date and time handling

In [106]:
import datetime

temp=pd.to_datetime(hydrants_wd.datecollec)

C:\Users\hdavi\Anaconda3\envs\tf4\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [107]:
hydrants_wd.dtypes

the_geom                    object
objectid                     int64
hydrant_id                  object
st_number                   object
st_name                     object
cross_st                    object
location                    object
hyd_type                    object
hyd_color                   object
datecollec     datetime64[ns, UTC]
x                          float64
y                          float64
map_num                      int64
map_quad                    object
hyd_num                      int64
insp_dist                    int64
comments                    object
datecollec2    datetime64[ns, UTC]
dtype: object